#
# 你在进行一个简化版的吃豆人游戏。你从 [0, 0] 点开始出发，
# 你的目的地是 target = [xtarget, ytarget] 。
# 地图上有一些阻碍者，以数组 ghosts 给出，
# 第 i 个阻碍者从 ghosts[i] = [xi, yi] 出发。
# 所有输入均为 整数坐标 。
#
# 每一回合，你和阻碍者们可以同时向东，西，南，北四个方向移动，每次可以移动到距离原位置 1 个单位 的新位置。
# 当然，也可以选择 不动 。所有动作 同时 发生。
#
# 如果你可以在任何阻碍者抓住你 之前 到达目的地（阻碍者可以采取任意行动方式），
# 则被视为逃脱成功。如果你和阻碍者同时到达了一个位置（包括目的地）都不算是逃脱成功。
#
# 只有在你有可能成功逃脱时，输出 true ；否则，输出 false 。
from collections import defaultdict
from typing import List


class Solution:
    def escapeGhosts(self, ghosts: List[List[int]], target: List[int]) -> bool:
        source = [0, 0]
        distance = manhattanDistance(source, target)
        return all(manhattanDistance(ghost, target) > distance for ghost in ghosts)

def manhattanDistance(point1: List[int], point2: List[int]) -> int:
    return abs(point1[0] - point2[0]) + abs(point1[1] - point2[1])

demo = Solution()
print(demo.escapeGhosts([[793,9579],[4375,8541],[7668,2976],[1405,-6226],[-6384,3429],[-8324,-1472],[4738,2717],[6182,2630],[-6738,1189],[-2851,-6597],[8377,6154],[6416,-4056],[-9358,-4503],[-5996,-4935],[-4087,8710],[-8537,-4851],[-4614,3900],[4628,850],[3892,8172],[6559,9750],[1704,-6017],[-1500,-4280],[5595,-8308],[1069,2097],[7171,-8754],[-2018,357],[-6349,-6607],[-9551,7222],[5196,-248],[5491,-1606],[1547,537],[-2657,-4177],[6582,-8872],[5436,-459],[6419,-3583],[-9798,8511],[-1802,6384],[-9717,7592],[839,9498],[2228,9980],[5455,-2751],[7210,2230],[-763,4687],[5444,-4496],[-2357,-8637],[7416,-9812],[-7962,-9934],[-8414,4825],[-7659,-5894],[8337,1484],[-5647,9054],[4581,-7605],[-3857,8343],[6834,9327],[-8837,-5064],[8680,958],[-3720,2124],[-535,1323],[-3436,-5330],[9440,-6890],[1872,-903],[-2410,598],[-154,9004],[-1512,2410],[9537,-7930],[-164,6859],[-1401,-4886],[6144,-9442],[6,-6827],[-8561,8014],[4617,7851],[-8756,-638],[4250,-6725],[1403,3367],[-1244,2536],[-8906,-9625],[-9950,1484],[7566,-9272],[7631,-665],[-1134,-6653],[-9273,-6891],[9110,2471],[-8844,-1683],[-3533,8801],[8585,-5125],[-5140,9914],[5212,-6899],[-6638,4092],[-7790,-901],[-4212,5948],[1526,2238],[-9513,7842],[1274,2462],[7528,116],[6648,-4132],[-6157,9177],[8119,1814],[-4279,-5573],[-8003,-9858],[-6671,3189]],
[3649,6156]))
print(demo.escapeGhosts(ghosts=[[1,0]], target=[2,0]))
print(demo.escapeGhosts(ghosts=[[1, 0], [0, 3]], target=[0, 1]))
print(demo.escapeGhosts(ghosts = [[5,0],[-10,-2],[0,-5],[-2,-2],[-7,1]], target = [7,7]))
print(demo.escapeGhosts(ghosts = [[-1,0],[0,1],[-1,0],[0,1],[-1,0]], target = [0,0]))
